// Напишите программу, которая будет принимать на
// вход два числа и выводить, является ли второе число
// кратным первому. Если число 2 не кратно числу 1, то
// программа выводит остаток от деления.
// ● 34, 5 -> не кратно, остаток 4
// ● 16, 4 -> кратно

Console.WriteLine("Введите первое число");
int A  =  int.Parse(Console.ReadLine()!);

Console.WriteLine("Введите второе число: ");
int B  =  int.Parse(Console.ReadLine()!);

if (A % B == 0) Console.WriteLine("Второе число кратно первому числу");
else Console.WriteLine($"Число {B} не кратно числу {A}, остаток: {A%B}");